<?php
/**
 * Created by PhpStorm.
 * User: Nikolay
 * Date: 10.02.2018
 * Time: 14:01
 */
//Вычисление дескриминанта квадратного уровнения
function discriminant($a, $b, $c){
    return $b * $b - 4 * $a * $c;
}

//Вычисление корней квадратного уровнения
function getRoots($a, $b, $D){
    if($D > 0){
        ?><br>Дискриминант положительный, у уровнения 2 корня:<br> x<sub>1</sub> = <?php
        echo getRoot1($a, $b, $D);
        ?><br> x<sub>2</sub> = <?php
        echo getRoot2($a, $b, $D);
    }
    elseif ($D  == 0){
        ?><br>Дискриминант равен нулю, у уровнения 1 корень:<br> x<sub>1</sub> = <?php
        echo getRoot1($a, $b, $D);
    }
    else {
        ?><br>Дискриминант отрицательный, уровнения не имеет корней.<?php
    }
}

//
function getSex($name){
    $namelist = ['альберт'=>'м',
        'александр'=>'м',
        'артем'=>'м',
        'максим'=>'м',
        'михаил'=>'м',
        'миша'=>'м',
        'иван'=>'м',
        'ваня'=>'м',
        'даниил'=>'м',
        'даня'=>'м',
        'алексей'=>'м',
        'лёша'=>'м',
        'дмитрий'=>'м',
        'дима'=>'м',
        'матвей'=>'м',
        'андрей'=>'м',
        'кирилл'=>'м',
        'николай'=>'м',
        'коля'=>'м',
        'альберт'=>'м',
        'анна'=>'ж',
        'аня'=>'ж',
        'виктория'=>'ж',
        'вика'=>'ж',
        'алиса'=>'ж',
        'полина'=>'ж',
        'анастасия'=>'ж',
        'настя'=>'ж',
        'александра'=>'ж',
        'евгения'=>'ж',
        'катя'=>'ж',
        'екатерина'=>'ж',
        'наталья'=>'ж',
        'мария'=>'ж',
        'маша'=>'ж'
    ];

    $sex = $namelist[mb_convert_case($name, MB_CASE_LOWER, "UTF-8")];
    return $sex;
}